Autodesk.Revit.DB.ElementTypeGroup.BendingDetail
The bending detail type.

Autodesk.Revit.DB.ElementTypeGroup.AlignmentStationLabelType
The alignment station label type.

Autodesk.Revit.DB.ElementTypeGroup.ViewTypeSystemsAnalysisReport
The system analysis report view type.